# Homebrew Bundle, list of all brew/cask apps
# run ./brew.sh or "brew bundle --describe"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "azure/functions"
tap "homebrew/cask-fonts"
# brew "azure-cli"                            # Azure CLI
# brew "azure-functions-core-tools"
# brew "aircrack-ng"                        # Wifi network security tool (blocked by Avast)
brew "baobab"                               # Disk Stats
# brew "bash-completion"                      # Bash Completion
brew "cask"                                 # Required for GUI apps
brew "ffmpeg"                               # Video editing
brew "gcc"                                  # Required for Mongodb
brew "gcloud"                               # GCP CLI
brew "genact"                               # Random CLI simulator
brew "gh"                                   # GitHub CLI
brew "git"                                  # Dev tool
brew "git-extras"                           # Extra git commands for productivity / reporting
brew "goenv"                                # Go version management
brew "golang"                               # Go Language tools
brew "googler"
brew "gnu-sed"                              # GNU version of sed
# brew "grafana"                              # grafana dashboard "brew services start grafana"
# brew "graphviz"                             # Lib to visualize data
brew "heroku/brew/heroku"                   # Heroku CLI
brew "htop"                                 # Better process tool
# brew "hugo"                                 # Static site generator
brew "jq"                                   # JSON command-line tool
# brew "kubectx"                            # Context switch for kubectl
# brew "kubernetes-cli"                     # Kubernetes cLI
# brew "kubernetes-helm"                    # Helm client for Kubernetes
brew "mas"                                  # Mac App store app to download existing apps
brew "mitmproxy"                            # Free proxy for analyzing web traffic (like Fiddler)
brew "mongodb/brew/mongodb-community-shell"   # MongoDB Shell
brew "nmap"                                 # Network utility
# brew "node", link: false                    # Nodejs language tools
# brew "npm"                                  # Node Package Manager
# brew "nvm"                                  # Node Version Manager
brew "pandoc"                               # File format converter
# brew "python3"                              # Python 3 including pip3
brew "shpotify"                             # CLI for Spotify on Mac
brew "tldr"                                 # simple, community-drive man pages
brew "tree"                                 # Tree visualization for directories
# brew "typescript"                           # Typescript language tools
# brew "yarn"                                 # JS/Node package
# brew "yarn-completion"                      # Statement completion for Yarn
brew "wget"                                 # File download
brew "youtube-dl"                           # CLI to download Youtube videos
brew "zsh"                                  # ZSH
brew "zsh-syntax-highlighting"              # ZSH syntax highlighting
brew "zsh-autosuggestions"                  # ZSH suggestions
cask "1password"                            # Password client service app
# cask "airserver"                            # Airplay or Google Cast to Mac
cask "anki"                                 # Anki - intelligent and social flash cards
# cask "avast-security"                     # Antivirus
# cask "background-music"                     # Windows-like per-app audio control
# cask "dash"                                 # Documentation client
cask "docker"                               # Docker container tools
cask "dotnet-sdk"                           # .NET language tools
# cask "discord"                              # Discord client (voice chat)
# cask "epic-games"                           # Epic Games
# cask "expressvpn"                           # Express VPN
cask "figma"                                # Figma client
cask "firefox"                              # Firefox browser
cask "font-cascadia"                        # Cascadia dev font
# cask "google-chrome"                        # Chrome browser
cask "kap"                                  # Screen capture animated gifs
cask "keepingyouawake"                      # Keeps MacOS from going to sleep indefinitely
cask "kindle"                               # Amazon Kindle app
cask "iterm2"                               # Terminal Window app
# cask "microsoft-azure-storage-explorer"     # Azure GUI Storage Tool
# cask "microsoft-office"                     # Microsoft Office
# cask "microsoft-teams"                      # Teams client
# cask "minikube"                             # Local Kubernetes tool
# cask "mongodb"                              # MongoDB database
cask "postman"                              # REST-API tool
cask "postgres"                             # Postgres client app
# cask "powershell"                         # PowerShell CLI
cask "robo-3t"                              # MongoDB data tool
# cask "skype"                                # Skype client
cask "slack"                                # Slack client
cask "spectacle"                            # Windows like move / resize windows
# cask "wifispoof"                            # Spoof MAC Address
cask "spotify"                              # Music service
# cask "steam"                                # Gaming service
# cask "suspicious-package"                   # Inspect Mac app packages before installing
cask "vlc"                                  # Play-everything media player
