# Homebrew Bundle, list of all brew/cask apps
# run ./brew.sh or "brew bundle --describe"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "azure-cli"                            # Azure CLI
# brew "aircrack-ng"                        # Wifi network security tool (blocked by Avast)
brew "baobab"                               # Disk Stats
brew "bash-completion"                      # Bash Completion
brew "cask"                                 # Required for GUI apps
brew "ffmpeg"                               # Video editing
brew "genact"                               # Random CLI simulator 
brew "git"                                  # Dev tool 
brew "git-extras"                           # Extra git commands for productivity / reporting
brew "gnu-sed"                              # Dev tool (req)
brew "golang"                               # Go Language tools
brew "goenv"                                # Go version management
brew "gnu-sed"                              # GNU version of sed
brew "grafana"                              # grafana dashboard "brew services start grafana"
brew "graphviz"                             # Python lib to visualize data 
brew "hugo"                                 # Static site generator
brew "jq"                                   # JSON command-line tool
# brew "kubectx"                            # Context switch for kubectl
# brew "kubernetes-cli"                     # Kubernetes cLI
# brew "kubernetes-helm"                    # Helm client for Kubernetes
brew "mas"                                  # Mac App store app to download existing apps
brew "nmap"                                 # Network utlitity
brew "node", link: false                    # Nodejs language tools
brew "npm"                                  # Node Package Manager
brew "python3"                              # Python 3 including pip3
brew "shpotify"                             # CLI for Spotify on Mac
brew "tldr"                                 # simple, community-drive man pages
brew "typescript"                           # Typescript language tools
brew "yarn"                                 # JS/Node package
brew "yarn-completion"                      # Statement completion for Yarn
brew "wget"                                 # File download
brew "youtube-dl"                           # CLI to download Youtube videos
brew "zsh"                                  # Z Shell
brew "zsh-completions"                      # Z Shell completions
cask "1password"                            # Password client service app
cask "airserver"                            # Airplay or Google Cast to Mac
# cask "avast-security"                     # Antivirus
cask "background-music"                     # Windows-like per-app audio control
cask "dash"                                 # Documentation client
cask "docker"                               # Docker container tools
cask "dotnet-sdk"                           # .NET lagnguage tools
cask "discord"                              # Discord client (voice chat)
cask "firefox"                              # Firefox browser
cask "google-chrome"                        # Chrome browser
cask "keepingyouawake"                      # Keeps MacOS from going to sleep indefinitely
cask "kindle"                               # Amazon Kindle app
cask "microsoft-azure-storage-explorer"     # Azure GUI Storage Tool
cask "microsoft-office"                     # Microsoft Office
cask "microsoft-teams"                      # Teams client
cask "minikube"                             # Local Kubernetes tool
cask "postman"                              # REST-API tool
cask "skype"                                # Skype client
cask "slack"                                # Slack client
cask "spectacle"                            # Windows like move / resize windows
cask "spoof"                                # Spoof MAC Address
cask "spotify"                              # Music service
cask "steam"                                # Gaming service
cask "suspicious-package"                   # Inspect Mac app packages before installing
cask "vlc"                                  # Play-everything media player
cask "vyprvpn"                              # VPN
mas "", id: 445770608
mas "", id: 425955336
mas "", id: 668208984
mas "", id: 715768417
mas "", id: 476272252
mas "", id: 585829637